## Plan Result (nonprod_general - TerraformPlanApply)




<pre><code>Plan: 1 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_web_application_firewall_policy.waf_policy
* Update
  * azurerm_application_gateway.ag
  * azurerm_private_endpoint.postgres_private_endpoint




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_application_gateway.ag will be updated in-place
  ~ resource "azurerm_application_gateway" "ag" {
      ~ firewall_policy_id                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGatewayWebApplicationFirewallPolicies/atlassian-nonprod-app-gateway-waf-policy" -> (known after apply)
      - force_firewall_policy_association = true -> null
        id                                = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway"
        name                              = "atlassian-nonprod-app-gateway"
        tags                              = {
            "application"  = "atlassian"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/atlassian-infrastructure"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "Medium"
            "environment"  = "staging"
            "startupMode"  = "always"
        }
        # (6 unchanged attributes hidden)

      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-cnf" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-cnf" -> null
          - path                                      = "/confluence" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-crd" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-crd" -> null
          - path                                      = "/crowd" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      - probe {
          - id                                        = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/probes/appgw-probe-jira" -> null
          - interval                                  = 30 -> null
          - minimum_servers                           = 0 -> null
          - name                                      = "appgw-probe-jira" -> null
          - path                                      = "/jira/status" -> null
          - pick_host_name_from_backend_http_settings = true -> null
          - port                                      = 0 -> null
          - protocol                                  = "Http" -> null
          - timeout                                   = 30 -> null
          - unhealthy_threshold                       = 3 -> null
            # (1 unchanged attribute hidden)

          - match {
              - status_code = [
                  - "200-399",
                ] -> null
                # (1 unchanged attribute hidden)
            }
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-cnf"
          + path                                      = "/confluence"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-crd"
          + path                                      = "/crowd"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }
      + probe {
          + id                                        = (known after apply)
          + interval                                  = 30
          + minimum_servers                           = 0
          + name                                      = "appgw-probe-jira"
          + path                                      = "/jira/status"
          + pick_host_name_from_backend_http_settings = true
          + protocol                                  = "Http"
          + timeout                                   = 30
          + unhealthy_threshold                       = 3
            # (1 unchanged attribute hidden)
        }

      - request_routing_rule {
          - http_listener_id            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/httpListeners/appgw-http-listener" -> null
          - http_listener_name          = "appgw-http-listener" -> null
          - id                          = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/requestRoutingRules/appgw-routing-rule" -> null
          - name                        = "appgw-routing-rule" -> null
          - priority                    = 1 -> null
          - rule_type                   = "PathBasedRouting" -> null
          - url_path_map_id             = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/applicationGateways/atlassian-nonprod-app-gateway/urlPathMaps/appgw-url-map-path" -> null
          - url_path_map_name           = "appgw-url-map-path" -> null
            # (8 unchanged attributes hidden)
        }
      + request_routing_rule {
          + backend_address_pool_id     = (known after apply)
          + backend_address_pool_name   = "appgw-backend-pool-cnf"
          + backend_http_settings_id    = (known after apply)
          + backend_http_settings_name  = "appgw-backend-settings-cnf"
          + http_listener_id            = (known after apply)
          + http_listener_name          = "appgw-http-listener"
          + id                          = (known after apply)
          + name                        = "appgw-routing-rule"
          + priority                    = 1
          + redirect_configuration_id   = (known after apply)
          + rewrite_rule_set_id         = (known after apply)
          + rule_type                   = "PathBasedRouting"
          + url_path_map_id             = (known after apply)
          + url_path_map_name           = "appgw-url-map-path"
            # (2 unchanged attributes hidden)
        }

      + waf_configuration {
          + enabled                  = true
          + file_upload_limit_mb     = 100
          + firewall_mode            = "Prevention"
          + max_request_body_size_kb = 128
          + request_body_check       = true
          + rule_set_type            = "OWASP"
          + rule_set_version         = "3.2"
        }

        # (17 unchanged blocks hidden)
    }

  # azurerm_private_endpoint.postgres_private_endpoint will be updated in-place
  ~ resource "azurerm_private_endpoint" "postgres_private_endpoint" {
        id                            = "/subscriptions/b7d2bd5f-b744-4acc-9c73-e068cec2e8d8/resourceGroups/atlassian-nonprod-rg/providers/Microsoft.Network/privateEndpoints/atlassian-nonprod-postgres-pe"
        name                          = "atlassian-nonprod-postgres-pe"
      ~ tags                          = {
          - "application"  = "atlassian" -> null
          - "builtFrom"    = "hmcts/atlassian-infrastructure" -> null
          - "businessArea" = "Cross-Cutting" -> null
          - "environment"  = "staging" -> null
        }
        # (7 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # azurerm_web_application_firewall_policy.waf_policy will be created
  + resource "azurerm_web_application_firewall_policy" "waf_policy" {
      + http_listener_ids   = (known after apply)
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "atlassian-nonprod-app-gateway-waf-policy"
      + path_based_rule_ids = (known after apply)
      + resource_group_name = "atlassian-nonprod-rg"

      + custom_rules {
          + action    = "Allow"
          + enabled   = true
          + name      = "JiraException"
          + priority  = 1
          + rule_type = "MatchRule"

          + match_conditions {
              + match_values       = [
                  + "\\/jira\\/(?:[^login\\.jsp\\W]).*",
                ]
              + negation_condition = false
              + operator           = "Regex"

              + match_variables {
                  + variable_name = "RequestUri"
                }
            }
        }
      + custom_rules {
          + action    = "Allow"
          + enabled   = true
          + name      = "Comments"
          + priority  = 2
          + rule_type = "MatchRule"

          + match_conditions {
              + match_values       = [
                  + "[comment]",
                ]
              + negation_condition = false
              + operator           = "Regex"

              + match_variables {
                  + variable_name = "RequestUri"
                }
            }
        }
      + custom_rules {
          + action    = "Allow"
          + enabled   = true
          + name      = "TechPod"
          + priority  = 10
          + rule_type = "MatchRule"

          + match_conditions {
              + match_values       = [
                  + "?src=spacemenu",
                ]
              + negation_condition = false
              + operator           = "Contains"

              + match_variables {
                  + variable_name = "QueryString"
                }
            }
        }
      + custom_rules {
          + action    = "Allow"
          + enabled   = true
          + name      = "JsonBulkPayLoad"
          + priority  = 11
          + rule_type = "MatchRule"

          + match_conditions {
              + match_values       = [
                  + "POST",
                ]
              + negation_condition = false
              + operator           = "Contains"

              + match_variables {
                  + selector      = "batch.js?locale=en-GB"
                  + variable_name = "PostArgs"
                }
            }
        }
      + custom_rules {
          + action    = "Allow"
          + enabled   = true
          + name      = "Confluence"
          + priority  = 12
          + rule_type = "MatchRule"

          + match_conditions {
              + match_values       = [
                  + "cql=",
                ]
              + negation_condition = false
              + operator           = "Contains"

              + match_variables {
                  + variable_name = "RequestUri"
                }
            }
        }
      + custom_rules {
          + action    = "Allow"
          + enabled   = true
          + name      = "ConfluenceStatusURLAllow"
          + priority  = 13
          + rule_type = "MatchRule"

          + match_conditions {
              + match_values       = [
                  + "status=",
                ]
              + negation_condition = false
              + operator           = "Contains"

              + match_variables {
                  + variable_name = "RequestUri"
                }
            }
        }
      + custom_rules {
          + action    = "Allow"
          + enabled   = true
          + name      = "ConfluenceBulk"
          + priority  = 14
          + rule_type = "MatchRule"

          + match_conditions {
              + match_values       = [
                  + "/rest/analytics/",
                  + "plugins/servlet/gadgets",
                ]
              + negation_condition = false
              + operator           = "Contains"

              + match_variables {
                  + variable_name = "RequestUri"
                }
            }
        }
      + custom_rules {
          + action    = "Allow"
          + enabled   = true
          + name      = "PlusSymbol"
          + priority  = 15
          + rule_type = "MatchRule"

          + match_conditions {
              + match_values       = [
                  + "[+]",
                ]
              + negation_condition = false
              + operator           = "Regex"

              + match_variables {
                  + variable_name = "RequestUri"
                }
            }
        }

      + managed_rules {
          + managed_rule_set {
              + type    = "OWASP"
              + version = "3.2"

              + rule_group_override {
                  + rule_group_name = "REQUEST-920-PROTOCOL-ENFORCEMENT"

                  + rule {
                      + action  = "Log"
                      + enabled = true
                      + id      = "920300"
                    }
                  + rule {
                      + action  = "Block"
                      + enabled = true
                      + id      = "920440"
                    }
                }
            }
        }

      + policy_settings {
          + enabled                                   = true
          + file_upload_enforcement                   = (known after apply)
          + file_upload_limit_in_mb                   = 100
          + js_challenge_cookie_expiration_in_minutes = 30
          + max_request_body_size_in_kb               = 2000
          + mode                                      = "Prevention"
          + request_body_check                        = true
          + request_body_enforcement                  = true
          + request_body_inspect_limit_in_kb          = 128
        }
    }

Plan: 1 to add, 2 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":36,"Program":"tfcmt","SHA1":"","Target":"nonprod_general - TerraformPlanApply","Vars":{}} -->